# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [29]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [30]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  7  7  6  9
1  4  5  1  3  7
2  3  6  2  1  9
3  5  6  2  4  7
4  9  3  5  1  5

In [31]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [32]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        7        7        6        9
1        4        5        1        3        7
2        3        6        2        1        9
3        5        6        2        4        7
4        9        3        5        1        5

In [33]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        7        7        6        9
1        4        5        1        3        7
2        3        6        2        1        9
3        5        6        2        4        7
4        9        3        5        1        5

## #02: Pemilihan baris (rows selection) pada data frame

In [34]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  3  2  1  3
1  3  4  3  4  1
2  4  4  4  1  2
3  4  4  1  2  2
4  3  3  2  1  1
5  1  3  4  2  2
6  4  3  1  1  1
7  4  3  4  4  4
8  2  4  2  3  2
9  4  4  1  3  1

In [35]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  1  3  2  1  3
1  3  4  3  4  1
4  3  3  2  1  1
5  1  3  4  2  2

In [36]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  1  3  2  1  3
1  3  4  3  4  1
4  3  3  2  1  1
5  1  3  4  2  2